src/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/КассоваяСмена/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриЗагрузкеДанныхИзНастроекНаСервере" формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Касса = Настройки.Получить("Касса");
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

// Процедура устанавливает отбор динамических списков формы.
//
&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", Касса, ЗначениеЗаполнено(Касса), ВидСравненияКомпоновкиДанных.Равно);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтатусыКассовойСмены", СтатусыКассовойСмены, ЗначениеЗаполнено(СтатусыКассовойСмены), ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры // УстановитьОтборДинамическихСписков()

// Процедура устанавливает отбор динамических списков формы.
//
&НаКлиенте
Процедура УстановитьОтборДинамическихСписковНаКлиенте()
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", Касса, ЗначениеЗаполнено(Касса), ВидСравненияКомпоновкиДанных.Равно);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтатусыКассовойСмены", СтатусыКассовойСмены, ЗначениеЗаполнено(СтатусыКассовойСмены), ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры // УстановитьОтборДинамическихСписков()

// Процедура - обработчик события "ПриИзменении" поля "Касса" на сервере.
//
&НаКлиенте
Процедура КассаОтборПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписковНаКлиенте();
	
КонецПроцедуры // КассаОтборПриИзменении()

&НаКлиенте
Процедура СтатусыКассовойСменыОтборПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписковНаКлиенте();
	
КонецПроцедуры // СтатусыКассовойСменыОтборПриИзменении()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработкиСтоматология.ПриСозданииНаСервере(ЭтаФорма);
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтрЕдиницаОтбор, ЗначениеЗаполнено(СтрЕдиницаОтбор));
КонецПроцедуры

#КонецОбласти
